<x-app-layout>
    <x-slot name="header">
        <!-- app css-->
        <link rel="stylesheet" type="text/css" href="{{ url('/css/app.css') }}" />
        <link href="https://fonts.googleapis.com/css2?family=Cairo:wght@400;600&display=swap" rel="stylesheet">

        @include('contract.nav.navigation')
        @include('service.nav.navigation')
    </x-slot>

    <div class="bg-custom py-6">
        <div class="max-w-full mx-auto  lg:px-8">
            <div class="overflow-hidden shadow-sm sm:rounded-lg">
                <div class="p-6 text-gray-900">
                    <div class="header-buttons">
                        <a href="{{ url()->previous() }}" class="btn btn-custom-back">
                            {{ __('word.back') }}
                        </a>
                        @can('contract-show')
                            <a href="{{ route('contract.show', $contract->url_address) }}" class="btn btn-custom-show">
                                {{ __('word.contract_view') }}
                            </a>
                        @endcan

                        <button id="print" class="btn btn-custom-print" onclick="window.print();">
                            {{ __('word.print') }}
                        </button>
                    </div>

                    <div class="print-container a4-width mx-auto  bg-white">
                        <div class="p-4" style="font-family: 'Cairo', sans-serif;">

                            <div class="flex">
                                <div class=" mx-2 my-2 w-full ">
                                    {!! QrCode::size(90)->generate($contract->id) !!}
                                </div>
                                <div class=" mx-2 my-2 w-full ">
                                    .
                                </div>
                                <div class=" mx-2 my-2 w-full ">
                                    .
                                </div>
                                <div class=" mx-2 my-2 w-full ">
                                    <img src="data:image/png;base64,{{ DNS1D::getBarcodePNG($contract->building->building_number, 'C39') }}"
                                        alt="barcode" />

                                    <p><strong>{{ __('العدد :') }}</strong>
                                        {{ $contract->id }}
                                    </p>
                                    <p><strong>{{ __('التاريخ :') }}</strong> {{ $contract->contract_date }}</p>

                                </div>
                            </div>
                            <div style="text-align: center; margin: 0.8rem auto; font-size: 0.9rem; font-weight: bold;">
                                <p>عقد بيع </p>
                            </div>
                            <div style="text-align: center; margin: 0.8rem auto; font-size: 0.9rem; font-weight: bold;">
                                <p>(عقد بيع وحده سكنية في مجمع واحة الياسمين السكني / النجف الاشرف )</p>
                            </div>
                            <div style="text-align: right; margin: 0.8rem auto; font-size: 0.9rem; font-weight: bold;">
                                <p>الطرف الأول/ شركة بوابة العلم للمقاولات والتجارة العامة المحدودة ويمثلها المدير
                                    المفوض /
                                    اضافة الى وظيفته. </p>
                            </div>
                            <div style="text-align: right; margin: 0.8rem auto; font-size: 0.9rem; font-weight: bold;">
                                <p>الطرف الثاني/ ({{ $contract->customer->customer_full_name }}) العنوان
                                    ({{ $contract->customer->full_address }}) رقم
                                    الموبايل({{ $contract->customer->customer_phone }})
                                </p>
                            </div>
                            <div style="text-align: right; margin: 0.8rem auto; font-size: 0.9rem; font-weight: bold;">
                                <p>بناءا على توفر وحده سكنية لدى الطرف الأول ضمن مجمع واحة الياسمين السكني والواقع في
                                    النجف الاشرف ضمن القطعة المرقمة (56/1) مقاطعه (15 بحر النجف) وبموجب الاجازة
                                    الاستثمارية
                                    المرقمة (318) في (18-2-2024).</p>
                            </div>
                            <div style="text-align: right; margin: 0.8rem auto; font-size: 0.9rem; font-weight: bold;">
                                <p>
                                    اولا: تمهيد <br>
                                    لما كان الطرف الاول يعمل في مجال الاستثمارات العقارية و انشاء المجمعات السكنية و
                                    يقوم ببناء مجمع واحة الياسمين السكني المشيد على الارض الواقعة في محافظة النجف الاشرف
                                    بموجب قانون الاستثمار العراقي رقم 13 لسنة 2006 المعدل , و الممنوح بموجب الاجازة
                                    الاستثمارية المرقمة (318) لسنة 18/02/2024 والصادرة من هيئة استثمار النجف .
                                    <br> ولما كان الطرف الاول راغبا ببيع الوحدات السكنية في المشروع أعلاه بنظام النقد او
                                    الاقساط , وبما ان الطرف الثاني يرغب بشراء و تملك الوحدة السكنية في مجمع واحة
                                    الياسمين
                                    , وبعد اقرار الطرفان بأهليتهما القانونية وخلو ارادتهما من اي عيب فقد اتفق الطرفان
                                    على بنود هذا العقد .

                                </p>
                                <p>ثانياً: اوصاف الوحده السكنية: <br>
                                    ١-رقم الوحده السكنية ({{ $contract->building->house_number }}) رقم البلوك
                                    ({{ $contract->building->block_number }}) نوع الوحده السكنية
                                    ({{ $contract->building->building_type->type_name }})
                                    ٢- المساحة الكلية للوحده السكنية ({{ $contract->building->building_area }}) مساحة
                                    البناء({{ $contract->building->building_real_area }})
                                    <br>
                                    ثالثاً : بدل شراء الوحده السكنية:
                                    رقما ({{ number_format($contract->contract_amount, 0) }})
                                    كتابتا({{ Numbers::TafqeetMoney($contract->contract_amount, 'IQD') }})
                                    <br>
                                    رابعاً: آلية تسديد بدل الوحده السكنية تكون على شكل
                                    {{ $contract_installments->count() == 1 ? 'دفعة واحدة' : 'اثنى عشر دفعة' }}
                                    وكالاتي:
                                </p>
                            </div>
                            <div style="text-align: right; margin: 0.8rem auto; font-size: 0.9rem; font-weight: bold;">
                                <p>
                                    @foreach ($contract_installments as $contract_installment)
                                        @php

                                            $installment = $contract_installment->installment;
                                            $installmentNumber = $installment->installment_number;
                                            $installmentName = $installment->installment_name;
                                            $installmentPercent = $installment->installment_percent * 100;
                                            $installmentAmount = number_format(
                                                $contract_installment->installment_amount,
                                                0,
                                            );
                                            $installmentAmountText = Numbers::TafqeetMoney(
                                                $contract_installment->installment_amount,
                                                'IQD',
                                            );

                                            // Determine the payment timing with dynamic installment number conversion
                                            $paymentTiming =
                                                $installmentNumber == 1
                                                    ? 'عند ابرام العقد'
                                                    : 'بعد ثلاثة اشهر من الدفعه ' .
                                                        App\Helpers\Number::convert($installmentNumber - 1); // Dynamically change the installment number to its corresponding word
                                        @endphp
                                        @if ($installmentNumber == 11)
                                            <div style="display: flex; justify-content: center;">
                                                <p style="font-size: 14px; font-weight: bold;">صفحة ( 1 - 7)</p>
                                            </div>
                                            <br>
                                            <br>
                                            <br>
                                            <br>
                                            <br>
                                            <br>
                                            <br>
                                            <br>
                                            {{ $installmentNumber . '- الدفعة ' . $installmentName . ': ( ' . $installmentPercent . ' %) من قيمة الكلية لبدل شراء الوحده السكنية وتدفع ' . $paymentTiming . ' ومقدارها ( ' . $installmentAmount . ') وكتابتا (' . $installmentAmountText . ') ' }}
                                        @else
                                            {{ $installmentNumber . '- الدفعة ' . $installmentName . ': ( ' . $installmentPercent . ' %) من قيمة الكلية لبدل شراء الوحده السكنية وتدفع ' . $paymentTiming . ' ومقدارها ( ' . $installmentAmount . ') وكتابتا (' . $installmentAmountText . ') ' }}
                                        @endif

                                        <br>
                                    @endforeach
                                </p>
                            </div>
                            <div style="text-align: right; margin: 0.8rem auto; font-size: 0.9rem; font-weight: bold;">
                                <p>في حالة رغبة الطرف الثاني الاستفاده من قرض مصرفي على الوحده السكنية وتسديدها الى
                                    الطرف الاول وحسب المبلغ الذي يحدد من قبل المصرف على ان يتحمل الطرف الثاني تسديد مبلغ
                                    القرض مع الارباح المترتبة عليه والمصاريف واتعاب المحاماة

                                    واي مصاريف اخرى ويبذل جهد
                                    من الطرف الأول لغرض الحصول على القرض من احد المصارف ويعتبر مبلغ القرض سدادا لما
                                    يقابله من مبلغ الدفعات الاخيره المذكوره في الفقره ثالثا من الية تسديد بدل شراء
                                    الوحده السكنية المتفق عليها في هذا العقد.
                                    وفي حالة تعذر حصول الطرف الاول على قرض من احد المصارف فيتم تسديد المبلغ من قبل الطرف
                                    الثاني وفقا لالية تسديد الدفعات المتفق عليها في هذا العقد.
                                </p>
                                <p>
                                    <br> خامساً: التعاريف
                                    <br> 1-الشركة : بوابة العلم للمقاولات والتجارة العامة والاستثمارات العقارية محدوده
                                    المسؤولية/النجف الاشرف
                                    <br> 2-العقد: يعني هذه الوثيقة التي توقعها الشركة مع المشتري لاي من الوحدات السكنية
                                    الواقعة داخل المشروع.
                                    <br> 3-موعد التسليم : هو موعد استلام المشتري للوحدة السكنية والتي يحددها الطرف الأول
                                    والمثبتة في هذا العقد.
                                    <br> 4-الوحدة السكنية : الوحدة السكنية المتعاقد عليها والمحددة في هذا العقد أو
                                    ملحقاته.
                                    <br> 5-الثمن : بدل الوحدة السكنية المتعاقد عليها والمحدد في هذا العقد او ملحقاته.
                                    جدول السداد : مواعيد ومقدار تسديد ثمن الوحدة السكنية كما مثبت بجدول في هذا العقد أو
                                    ملحقاته.
                                    الحساب المصرفي : هو الحساب المصرفي التابع للطرف الأول والواجب استخدامه من قبل
                                    المشتري لسداد ثمن الوحدة السكنية.
                                    <br> 6-الفوائد القانونية : هي الفوائد المبينة نسبها في العقد نتيجة التخلف او التأخير
                                    عن تسديد الدفعات المستحقة في مواعيد استحقاقها او اية فوائد قانونية ورد النص عليها في
                                    العقد أو في القانون المدني العراقي.
                                    @if ($contract_installments->count() == 1)
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                    @endif

                                    <br> 7-التسجيل: هو تسجيل الوحدة السكنية المباعة لدى الجهات المختصة وفق القانون.
                                    <br> 8-الملاحق : جميع المرافقات مع هذا العقد والتي تعتبر جزء لا يتجزء منه.

                                </p>

                                <p>
                                    <br> سادساً: موضوع العقد

                                    <br>1- باع الطرف الأول الى الطرف الثاني الوحدة السكنية المدرجة تفاصيلها في الملاحق
                                    المرفقة ربطاً بهذا العقد بيعاً موقوفاً على سداد كامل الثمن وملحقاته وما هو محدد
                                    للوحدة السكنية المدرجة تفاصيلها في ملاحق هذا العقد وطبقاً لموقع الوحدة السكنية
                                    المحدد بالمخطط العام للمشروع .

                                    <br>2- يعتبر توقيع الطرف الثاني على هذا العقد موافقته المطلقة غير القابلة للنقض ويقر
                                    باطلاعه على الخرائط والتراخيص والمستندات والتصاميم الهندسية الداخلية والخارجية
                                    الخاصة بالوحدة السكنية موضوع العقد والمخطط العام للمشروع وموافقته عليها وأخذ علما
                                    نافيا للجهالة بمواصفات الأكساء الداخلية والخارجية للوحدة السكنية موضوع العقد واطلع
                                    على طبيعة الأرض المنفذ عليها المشروع الاستثماري محل هذا العقد ويقر بأنه أحاط علما
                                    بكل القوانين واللوائح والقرارات والضوابط المتعلقة بالمشروع .

                                </p>
                                <p>
                                    <br> سابعاً: الثمن

                                    <br> 1- ان ثمن الوحدة السكنية موضوع هذا العقد البند الثالث .

                                    <br> 2- يلتزم الطرف الثاني بدفع ثمن الوحدة السكنية المشار لها في الفقرة ( البند
                                    رابعا المبينة حسب الجدول ) السداد المشار في البند رابعاً

                                    <br> 3- يلتزم الطرف الثاني بسداد جميع الدفعات المشار لها في البند رابعاً وحسب
                                    التواريخ المثبتة ولدى البنك المحدد من قبل الطرف الأول مع تزويد الطرف الأول بوصل
                                    الايداع لأثبات ذلك .
                                    @if ($contract_installments->count() == 12)
                                        <div style="display: flex; justify-content: center;">
                                            <p style="font-size: 14px; font-weight: bold;">صفحة ( 2 - 7)</p>
                                        </div>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                    @endif
                                    <br> 4- لا تبرأ ذمة الطرف الثاني المالية إلا بعد سداد كامل بدل البيع ويمكن للطرف
                                    الثاني استلام الوحدة السكنية قبل سداد كامل الثمن للوحدة السكنية دون حصوله على براءة
                                    ذمة سداد كامل

                                    الثمن من الطرف الأول ، ولا يتم تحويل سند ملكية الوحدة السكنية للطرف الثاني الا بعد
                                    سداد كامل ثمن الوحدة السكنية كما مبين في البند اولا واستلامها استلام نهائي.
                                    <br> 5- لا يجوز للطرف الثاني تأخير أي قسط عن التاريخ المحدد له ولا يجوز له الاحتجاج
                                    لعدم السداد ضد الطرف الأول لأي سبب من الاسباب والا عد الطرف الثاني مخلاً اخلالاً
                                    جوهرياً في التزاماته التعاقدية مما يجيز للطرف الأول العمل بأحكام الفسخ التلقائي
                                    لتحقق الشرط الفاسخ الصريح (تعمد الامتناع عن التسديد ) او انذار او حكم قضائي ويطبق
                                    البند ثالثا من التزامات الطرف الثاني دون الحاجة للرجوع الى القضاء

                                    <br> 6- ان قيمة هذا العقد غير شاملة لأي رسوم حكومية أو مبالغ إضافية قد تفرضها الدولة
                                    أو أي رسوم أخرى.

                                </p>
                                <p>
                                    <br> ثامناً: التزامات و حقوق الطرف الاول :

                                    <br>1- يلتزم الطرف الأول بتسليم الوحدة السكنية موضوع العقد للطرف الثاني خالية من
                                    الشواغر وجاهزة للسكن بعد انتهاء المدة المحددة للتسليم ، كما يلتزم الطرف الأول بتسليم
                                    الوحدة السكنية موضوع العقد للطرف الثاني من خلال لجنة تسليم الوحدات السكنية المحددة
                                    من قبل الطرف الأول وبموجب محضر استلام موقع من الطرفين وخلال الموعد المحدد
                                    <br>2- يحق للطرف الأول تمديد مدة تسليم الوحدة السكنية موضوع العقد بموجب المدد
                                    الاضافية الممنوحة من قبل هيئة استثمار النجف عن تاريخ استلامها شريطة أن يبلغ الطرف
                                    الثاني بتمديد الفترة ولا يحق للطرف الثاني المطالبة بأي تعويض لقاء هذا التأخير الناجم
                                    عن اسباب خارجة عن ارادة الطرف الأول حال وجودها ، أو في حال وجود اسباب قانونية او
                                    ادارية أو قوة قاهرة او اسباب هندسية التي تحول دون تسليم او اكمال ما تبقى من اعمال
                                    بناء للوحدة السكنية، على ان لا تتجاوز مدة التمديد سنة ميلادية واحدة من تاريخ التسليم
                                    المحددة
                                    @if ($contract_installments->count() == 1)
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                    @endif <br>3- يلتزم الطرف الأول بتسليم الطرف الثاني صورة
                                    المستندات اللازمة لإتمام تسجيل
                                    عملية نقل ملكية الوحدة السكنية متى طلب الطرف الثاني ذلك رسمياً بموجب طلب تحريري موقع
                                    منه او من يخوله قانوناً بشرط تسديده كافة الالتزامات المالية المترتبة بذمته ، ولا يحق
                                    للطرف الأول الامتناع عن الحضور لإتمام عملية انتقال الملكية بصورتها النهائية عند طلب
                                    الطرف الثاني ذلك وفي حال امتناع الطرف الأول عن إكمال عملية انتقال الملكية للطرف
                                    الثاني فيحق للأخير مطالبة الطرف الأول بذلك قضائيا وتحميله الرسوم والمصاريف واتعاب
                                    المحاماة ، ويعتمد بدء اجراءات نقل الملكية وموعد الانتهاء منها على إجراءات الدوائر
                                    الحكومية المعنية وما تتطلبه من وقت لا جراء ذلك وحسب التعليمات والقوانين النافذة في
                                    العراق .
                                    <br>4- يلتزم الطرف الأول بكافة مصاريف إيصال الخدمات المتعلقة بالوحدة السكنية من حدود
                                    المشروع لغاية الوحدة السكنية وهي على سبيل الحصر( الماء , الكهرباء , المجاري ) ويتحمل
                                    الطرف الثاني دفع اجور استخدام هذه الخدمات الى الجهات ذات العلاقة.
                                    <br> 5- يلتزم الطرف الأول بالجدول الزمني للمشروع والبناء وفق التصاميم الهندسية
                                    التفصيلية
                                    المصادق عليها من قبل هيئة استثمار النجف التي بموجبها تم منح الاجازه الاستثمارية.
                                    <br> 6- يلتزم الطرف الاول بتسليم الوحده السكنية المنجزه المتعاقد عليها الى الطرف
                                    الثاني خالية من الشواغل عند انتهاء المده الممنوحة الى المشروع شرط أن يسدد الطرف
                                    الثاني جميع الالتزامات المالية قبل التسليم.
                                    <br> 7- يلتزم الطرف الأول بتوفير مركز متكامل لغرض الإجابة عن الأسئلة
                                    والاستفسارات الخاصه بالوحده السكنية وان المركز غير ملزم بالإجابة لغير المتعاقدين
                                    للحفاظ على سرية البيانات والمعلومات للمشتركين.
                                    <br> 8- يلتزم الطرف الأول باحكام الضمان الخاصه بالمشروع والتي التزم بها مع هيئة
                                    استثمار النجف الاشرف والقوانيين والانظمه الازمه بحدود تعلق الامر بالوحده السكنية
                                    موضوع العقد وخدماتها وبنيتها التحتية
                                    @if ($contract_installments->count() == 12)
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>

                                        <div style="display: flex; justify-content: center;">
                                            <p style="font-size: 14px; font-weight: bold;">صفحة ( 3 - 7)</p>
                                        </div>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                    @endif
                                </p>
                                <p>
                                    <br>تاسعاً: التزامات وحقوق الطرف الثاني:

                                    <br>1- يلتزم الطرف الثاني على انتفاعه . بالوحدة السكنية | وملحقاتها على الغرض التي
                                    انشأت من اجله وهو السكن حصراً لكون ان ( مشروع واحة الياسمين ) هو مشروع سكني متكامل
                                    يشتمل على كافة الخدمات، ولا يجوز استخدام الوحدة السكنية موضوع هذا العقد لغير اغراض
                                    السكن مطلقاً، بحيث لا يجوز له او لخلفه الخاص او العام استعمال الوحدة السكنية موضوع
                                    العقد في اي غرض تجاري او اداري او صناعي او تعليمي او مهني او ديني او اي استخدام آخر،
                                    وكما لا يجوز شطر الوحدة السكنية الى أكثر من وحدة.
                                    <br>2- يحظر على الطرف الثاني بيع او رهن الوحدة السكنية أو حجزها او التنازل عنها او
                                    التصرف بها او اي امتيازات او حقوق على الوحدة السكنية الى الغير الا بعد اخذ الموافقة
                                    التحريرية من الطرف الاول و اجور الخدمات ومصاريف الصيانة وكافة التزا اماته المالية
                                    الناشئة عن هذا العقد المفكر إلى الى الطرف الأول . ويقع باطلاً أي تصرف يخالف ذلك ،
                                    وبخلافه يحق للطرف الأول فسخ العقد دون انذار مسبق .
                                    <br>3- يلتزم الطرف الثاني بعدم إجراء أي تعديل على الواجهة الأمامية للوحدة السكنية
                                    مما يغير من شكلها العام أو تعديل الطراز الذي صممت وفقا له لتبقى محافظة على المظهر
                                    الأمامي الأصلي وبطراز المباني السائدة الذي تقع من ضمنها الوحدة السكنية.
                                    <br>4- في حال حدوث اي ضرر ناتج عن اعمال الصيانة أو ترميم أو تغيير وماشابه ذلك من
                                    الطرف الثاني دون استحصال موافقة من الطرف الأول يتحمل الطرف الثاني كامل المسؤولية
                                    المالية والقانونية جراء ذلك الاخلال.
                                    <br>5- يلتزم الطرف الثاني بتسديد كافة الرسوم والضرائب والمصاريف التي تتعلق بانتقال
                                    الملكية اليه لايحق له مطالبة الطرف الأول بالتعويض عن تلك المصاريف أو الرسوم أو
                                    الضرائب في حال وجودها ، ويلتزم بتسديد أي رسوم أو مبالغ إضافية قد تفرضها الدولة على
                                    الطرف الأول او الوحدة السكنية وحسب الآلية التي تحددها الدولة.

                                    @if ($contract_installments->count() == 1)
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                    @endif <br>6- يقر الطرف الثاني أنه اطلع على مواصفات الوحدة
                                    السكنية وعاينها معاينة نافية
                                    للجهالة وقام بتفقدها بدقة، كما أبدى موافقته الكاملة على هذه المواصفات. بالإضافة إلى
                                    ذلك، فأن الطرف الأول يقوم بتنفيذ الوحدة السكنية حسب توجيهات المكتب الاستشاري، ووفقا
                                    للمواصفات المحددة بالتفصيل في الملحق رقم (1) وان الألوان والقياسات والنوعية قد تختلف
                                    عن المواصفات المحددة وان الطرف الأول يقوم باستخدام جميع المواد والألوان والجودة
                                    المستخدمة في عملية التنفيذ وفقا لما يكون متاحا في وقت التنفيذ ويتناسب مع متطلبات
                                    العمل. ويقر الطرف الثاني بعلمه أن النموذج الذي يتم تقديمه للتوضيح فقط ولا يلزم الطرف
                                    الأول بالالتزام بتنفيذه بشكل دقيق. هذا يعني أن الطرف الثاني يعترف بأن التفاصيل
                                    الدقيقة للتنفيذ قد تختلف قليلا عن النموذج وأن الطرف الأول ليس ملزما بتنفيذ كل
                                    التفاصيل بشكل مطابق للنموذج.

                                    <br>7- يلتزم الطرف الثاني بالحضور شخصياً أو بحضور من يمثله قانوناً لغرض استلام
                                    الوحدة السكنية موضوع العقد حال إنجازها ذلك بعد تبليغه من قبل الطرف الأول بواسطة
                                    التبليغ بطرق التبليغ المتفق عليها في هذا العقد وعبر الاتصال الهاتفي أو البريد
                                    الالكتروني أو الرسائل النصية، وخلال مدة (15) خمسة عشر يوماً من تاريخ التبليغ وبخلافه
                                    يعد الطرف الثاني مخلاً اخلالاً جوهرياً بالعقد، وان انتهاء المدة اعلاه دون حضور الطرف
                                    الثاني عندها يعتبر الاخير مستلماً للوحدة السكنية استلاماً حكمياً وانها كاملة وسليمة
                                    ومطابقة للمواصفات المتفق عليها واعتبرت الوحدة السكنية موضوع هذا العقد وملحقاتها في
                                    حيازة الطرف الثاني ويعتبر وفاء من الطرف الأول بجميع التزاماته بالتسليم وما يترتب على
                                    ذلك من آثار وتصبح دفعة الاستلام بمجرد التسليم الحكمي المشار له اعلاه مستحقة الدفع
                                    ويسري على التأخير الغرامات المطلوبة في العقد.

                                    <br>8- تنتقل مسؤولية الوحدة السكنية موضوع هذا العقد الى الطرف الثاني عند توقيع محضر
                                    الاستلام من قبل الطرف الثاني او من يخوله قانوناً أو عند التسليم الحكمي ، وعندها يعد
                                    الطرف الثاني مسؤولاً مسؤولية كاملة عن الوحدة السكنية ، ويلتزم الطرف الثاني بتوقيع
                                    عقد الخدمات عند توقيع عقد الوحدة السكنية.

                                    <br>9- في حال وفاة الطرف الثاني اثناء سريان هذا العقد أو عند استلام الوحدة السكنية
                                    أو بعد استلامها، عندها يحل محل الطرف الثاني في كافة حقوقه والتزاماته وكل ما ورد في
                                    هذا العقد ورثته فقط وبموجب قسام شرعي صادر من قبل المحكمة المختصة، وتسري هذه الفقرة
                                    ايضا في حال فقدان الطرف الثاني للأهلية أو في حال حجره او إفلاسه او اعساره او وجود
                                    مانع من موانع الاهلية او عارض من عوارض الاهلية وذلك بموجب حكم بات صادر من محكمة
                                    مختصة .
                                    @if ($contract_installments->count() == 12)
                                        <br>
                                        <br>
                                        <div style="display: flex; justify-content: center;">
                                            <p style="font-size: 14px; font-weight: bold;">صفحة ( 4 - 7)</p>
                                        </div>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                    @endif
                                    <br>10- يتحمل الطرف الثاني مسؤولية إنجاز معاملة انتقال ملكية الوحدة السكنية باسمه
                                    والسير بها بكافة مراحلها على أن يلتزم الطرف الأول أو من يمثله قانونا بالحضور أمام
                                    الجهات الرسمية في حال الحاجة للإقرار بالبيع وأخذ توقيعه بذلك.
                                    <br>11-لا يجوز للطرف الثاني التصرف بالوحدة السكنية موضوع العقد تصرف المالك بملكيته
                                    قبل الوفاء بكافة التزاماته المالية للطرف الأول ونقل ملكية الوحدة السكنية باسمه.
                                    <br>12- يلتزم الطرف الثاني بدفع فواتير الانترنت الخاصة بالوحدة السكنية واجور خدمات
                                    النظافة والصيانة الخاصة بالمجمع والتي تحددها الجهات ذات العلاقة.

                                    <br>13- يلتزم الطرف الثاني فور استلامه للوحدة السكنية موضوع هذا العقد بدفع رسوم عداد
                                    الكهرباء والماء الى الطرف الأول والتي يتم تحديدها من قبل الجهات المختصة، و ليتمكن
                                    الأخير بالقيام بالإجراءات اللازمة لتركيب عداد الكهرباء والماء للوحدة السكنية
                                    المذكورة في هذا العقد وفق القانون على أن تكون الرسوم ومصاريف الاستهلاك بعد ذلك على
                                    عاتق الطرف الثاني وحده وفي حال مخالفة الطرف الثاني لما تقدم أو استخدامه أي مصدر من
                                    مصادر الكهرباء والماء الخاصة بالمشروع أو الأجزاء المشتركة يتحمل وحده المسؤولية
                                    القانونية المترتبة على ذلك مع الغرامة المترتبة عليه .
                                    <br> 14- يلتزم الطرف الثاني بتقديم البيانات الضرورية الخاصه به وتحديد محل اقامته
                                    ويكون هذا المحل هو العنوان المختار للتباليغ والانذارات وعند تغير عنوانه وجب عليه
                                    اعلام الطرف الأول بالمحل الجديد والا اعتبر العقد ملغى.
                                    <br> 15- في حالة تاخر الطرف الثاني عن التسديد المدرج في الفقره (ثالثا) من الية
                                    التسديد بدل شراء الوحده السكنية تضاف غرامة مقدارها (١٠%) من قيمة الدفعه المستحقه
                                    المتأخره عن كل شهر.
                                    <br>16- في حالة تاخر الطرف الثاني عن التسديد بعد
                                    انتهاء مدة ثلاثون يوما جاز
                                    للطرف الأول فسخ العقد اذا لم يبادر الطرف الثاني بتسديد المبلغ والغرامات التأخيرية
                                    خلال (مدة خمسة عشريوما) من انتهاء الثلاثون يوم دون الحاجة الى انذاره عند طريق الكاتب
                                    العدل ودون الحاجة إلى اللجوء إلى القضاء استنادا الى احكام الماده(١٧٧و ١٧٨)من القانون
                                    المدني العراقي ويحق للطرف الأول التصرف بالعقار للغير على إن يتحمل الطرف الثاني
                                    الغرامات التأخيرية لحين احلال مشتري اخر محله ويستحق الطرف الثاني )٥٠%) من المبلغ
                                    الواصل للطرف الأول وفي حالة عدم استلام الطرف الثاني للمبلغ المستحق له جاز للطرف
                                    الأول ايداع المبلغ لدى الدوائر المختصه.

                                </p>
                                @if ($contract_installments->count() == 1)
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                @endif
                                <p>
                                    <br> عاشراً: الفسخ

                                    <br>1- يتحقق الانفساخ التلقائي عند تحقق احد الشروط الواردة في الفقرة (17) من
                                    التزامات الطرف الثاني، دون الحاجة الى اعذار او انذار رسمي او حكم قضائي وذلك بموجب
                                    المادة 178 من القانون المدني العراقي رقم 40 لسنة 1951 المعدل، ويتم ارجاع ( 50% ) من
                                    المبلغ الذي سبق وان تم تسديده من قبل الطرف الثاني بعد مرور (6) ستة اشهر من تاريخ فسخ
                                    العقد او بعد بيع الوحدة السكنية .
                                    <br>2- يجوز للطرف الأول فسخ العقد اذا قام الطرف الثاني بالأخلال بأي فقرة من فقرات
                                    هذا العقد دون الحاجة الى اعذار او انذار رسمي او حكم قضائي وذلك بموجب المادة 178 من
                                    القانون المدني العراقي رقم 40 لسنة 1951 المعدل. ويتم ارجاع ( 50%) من المبلغ الذي سبق
                                    وان تم تسديده من قبل الطرف الثاني بعد مرور 6 اشهر من تاريخ فسخ العقد أو بعد بيع
                                    الوحدة السكنية.

                                </p>
                                <p>
                                    <br> احد عشر: العناوين الرسمية للتبليغ والمراسلات

                                    <br>1-يعتبر العنوان الموجود إلى جانب اسم كل طرف من الأطراف موطنا مختارا له ترسل إليه
                                    الإنذارات الرسمية والتبليغات القضائية وتبليغات الطرف الأول، لذا يلتزم كل طرف من طرفي
                                    العقد بإبلاغ الطرف الآخر عند تغيير العنوان المثبت في العقد وخلافه يتم اتباع الطرق
                                    القانونية التي رسمها القانون في ما يخص ذلك.

                                    <br>2- يقر الطرف الثاني بأن ارقام الهواتف والبريد الالكتروني ادناه خاصة به وتعتبر
                                    المكالمات او الرسائل الواردة على هذه الارقام من قبل الطرف الأول تبليغات قد تبلغ بها
                                    الطرف الثاني فعلياً وهو على علم كامل بها ويتحمل المسؤولية جراء اخلاله وعدم التزامه
                                    بها.

                                </p>
                                @if ($contract_installments->count() == 12)
                                    <br>
                                    <br>
                                    <div style="display: flex; justify-content: center;">
                                        <p style="font-size: 14px; font-weight: bold;">صفحة ( 5 - 7)</p>
                                    </div>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                @endif
                                <p>
                                    <br> ثاني عشر: الاختصاص القضائي

                                    يتم حل الخلافات التي تنشأ عن هذا العقد وديا بين الطرفين وخلال (30) يوما من تاريخ
                                    نشوء الخلاف وتبليغ احد الطرفين الى الطرف الآخر، وخلافه فإن المحاكم المختصة في محافظة
                                    النجف الأشرف هي صاحبة الاختصاص بنظر الدعاوى الناشئة بين الطرفين عن هذا العقد.

                                </p>
                            </div>
                            <div style="text-align: right; margin: 0.8rem auto; font-size: 0.9rem; font-weight: bold;">
                                <p>

                                    <br> ثالث عشر: احكام عامة

                                    <br> 1- يُفسر هذا العقد وكافة الأمور المتصلة به وفقاً للقوانين والتعليمات النافذة في
                                    جمهورية العراق.
                                    <br> 2- يتحمل الطرف الثاني مسؤولية تقديم اية معلومات او وثائق غير اصولية الى الطرف
                                    الأول
                                    <br> 3- يلتزم الطرفان بالحفاظ على سرية ما ورد في هذا العقد وعدم إفشائه للغير بدون
                                    الحصول
                                    على موافقة خطية من الطرف الآخر.
                                    <br> 4- يتضمن هذا العقد كل ما أتفق عليه الطرفان من شروط وأحكام، ولا يجوز التعديل أو
                                    التغيير فيه إلا بموافقة الطرفين الكتابية على ان ينظم ذلك بملحق عقد ويعتبر جزء لا
                                    يتجزء من العقد الاصلي، ويعتبر هذا العقد نهائياً وملزما لطرفيه ولا يجوز العدول عنه أو
                                    الطعن فيه لأي سبب من الأسباب.
                                    <br> 5- للطرف الأول الحق في اتخاذ كافة الاجراءات القانونية ضد الطرف الثاني في حالة
                                    التشهير أو الابتزاز أو نشر الشائعات عن المشروع أو الطرف الأول، سواء كان ذلك عبر
                                    وسائل التواصل الاجتماعي، أو من خلال التجمهر أمام المشروع أو الشركة، أو في أي مكان
                                    آخر، أو من خلال نشر مقاطع فيديو من داخل المشروع أثناء البناء أو الصيانة، أو باستخدام
                                    أي وسيلة أخرى فضلاً عن ذلك، يحق للطرف الأول مطالبة الطرف الثاني بتعويض مالي عن
                                    الأضرار التي تكبدها نتيجة لهذه الأفعال وعليه يتعهد الطرف الثاني بالالتزام بالقوانين
                                    والتعليمات والأنظمة القانونية النافذة في العراق، ويطبق عليه الفقرة (38) اعلاه
                                    <br> 6- في حال رغبة الطرف الثاني توكيل المجموعة القانونية التابعة للطرف الأول من
                                    السير
                                    بعملية انتقال ملكية الوحدة السكنية باسمه فانه يتحمل الأجور المالية المترتبة عن ذلك
                                    لإنجاز معاملات انتقال الملكية وذلك بموجب عقد خدمات قانونية يبرم بين المجموعة
                                    القانونية التابعة للطرف الأول والطرف الثاني وبموجب وكالة رسمية.
                                    @if ($contract_installments->count() == 1)
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                        <br>
                                    @endif <br> 7- ان الشوارع والحدائق والمساحات العامة داخل
                                    المشروع هي ملك عام ولا يحق للطرف
                                    الثاني
                                    استغلالها لأغراض شخصية او عرض دعايات او منشورات خاصة به، وبخلافه يحق للطرف الأول
                                    اتخاذ الاجراءات القانونية بحق المخالفين لهذه الفقرة.

                                    <br> 8- لايمكن بيع الوحده السكنية او التنازل عنها للغير او للخلف الخاص او الهبة
                                    باي شكل من اشكال العمليات التصرفية الا بالموافقة التحريرية من قبل الطرف الأول.
                                    <br> 9- يلتزم الطرف الأول بنقل ملكية الوحده السكنية إلى الطرف الثاني في دائرة
                                    التسجيل العقاري في النجف الاشرف على إن يتحمل الطرف الثاني جميع الرسوم والمصاريف
                                    واتعاب المحاماة التى تقتضيها اجراءات نقل الملكية.
                                    <br> 10- في حالة رغبت الطرف الثاني بفسخ العقد على ان يقدم
                                    طلب إلى الطرف الأول لاستحصال موافقته ويتم استقطاع مبلغ مقداره (٥٠%) من المبلغ
                                    المستلم من قبل الطرف الأول ويسلم المبلغ المتبقي والبالغ قيمته(٥٠%)الى الطرف الثاني
                                    بعد بيع الوحده السكنية الى مشتري آخر.

                                    <br> 11- تكون العمله العراقيه هي المعتمده في تسديد أقساط الوحده السكنية.
                                    <br> 12- يلتزم الطرف الثاني بدفع جميع الرسوم المستحقه للدوائر والازمه لتسجيل
                                    الوحده السكنية في دائرة التسجيل العقاري والدوائر ذات العلاقه.
                                    <br> 13- في حالة حدوث ظروف طارئة او قاهرة يراعى ذلك بالنسبة للمدد الزمنية
                                    المحدده
                                    من قبل الطرف الأول بخصوص تسليم الوحده السكنية ويحق للطرف الأول تمديد المدد الزمنية
                                    الخاصه بتسليم الوحده السكنية إلى الطرف الثاني.
                                    <br> 14- في حالة انهيار سوق العقار في العراق فان الطرف الأول غير ملزم بتغير
                                    اسعار
                                    الوحده السكنية موضوع هذا العقد
                                    <br> 15- تكون مدة تسليم الوحده السكنية الى الطرف الثاني مدة ( ٣٦شهر) تبدأ من
                                    تاريخ ابرام العقد ولا يحق للطرف الثاني مطالبة الطرف الأول بتسليم الدار قبل هذه
                                    الفتره حتى وان تم نقل ملكية الوحده السكنية الى الطرف الثاني.
                                    <br> 16- اي نزاع ينشأ بسبب هذا العقد تكون محكمة بداءة النجف هي المحكمة المختصه
                                    بالنظر في هذا النزاع.
                                    <br> 17- يخضع هذا العقد لقانون الاستثمار رقم (١٣) لسنة (٢٠٠٦) وتعديلاته
                                    وانظمته وتعليماته.
                                </p>
                                @if ($contract_installments->count() == 12)
                                    <br>
                                    <div style="display: flex; justify-content: center;">
                                        <p style="font-size: 14px; font-weight: bold;">صفحة ( 6 - 7)</p>
                                    </div>

                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                    <br>
                                @endif
                                <p>
                                    <br> رابع عشر: نسخ العقد و الملاحق

                                    حرر هذا العقد من (8) صفحات وملاحقه في محافظة النجف الاشرف من نسختين تسلم نسخة لكل
                                    طرف للعمل بموجبه ومرافق هذا العقد الملاحق المذكورة ادناه والتي تعد جزء لا يتجزء منه

                                    <br>ملحق رقم ( 1 ) : عقد الخدمات
                                    <br>ملحق رقم ( 2 ) : جدول المواد المستخدمة بالوحدة السكنية
                                    <br>ملحق رقم ( 3 ) : تعهد بالمحافظة على طابع المشروع

                                    <br>لقد قرأ الموقعون ادناه عقد بيع الوحدة السكنية وتم فهم شروطه المنصوص عليها في
                                    البنود الاحدى عشر أعلاه ويوافق الطرفان على أن يكونان مسؤولان عن جميع الالتزامات
                                    بموجب هذا العقد واذا كان الطرف الثاني شخصان او ثلاث اشخاص فيكونون متضامنين
                                    بالمسؤولية ومتساويين بالحصص.

                                </p>
                            </div>

                            <div style="text-align: right; margin: 0.8rem auto; font-size: 0.9rem; font-weight: bold;">
                                <p> خامس عشر: تم ابرام هذا العقد بأرادة الطرفين بتاريخ
                                    {{ \Carbon\Carbon::now()->format('Y/m/d') }}</p>

                            </div>
                            <br>
                            <br>
                            <br>
                            @if ($contract_installments->count() == 12)
                                <br>
                                <br>
                                <br>
                                <br>
                                <br>
                                <br>
                                <br>
                                <br>
                                <br>
                            @endif
                            <div class="flex ">
                                <div
                                    style="text-align: center; margin: 1rem auto; font-size: 0.875rem; font-weight: bold;">
                                    <p> الطرف الثاني
                                        <br>
                                        <br>
                                        <br> التوقيع /
                                        <br> الاسم / {{ $contract->customer->customer_full_name }}
                                        <br> رقم الهوية / {{ $contract->customer->customer_card_number }}
                                        <br> العنوان / {{ $contract->customer->full_address }}
                                    </p>
                                </div>
                                <div
                                    style="text-align: center; margin: 1rem auto; font-size: 0.875rem; font-weight: bold;">
                                    <p> الطرف الاول
                                        <br>
                                        <br>
                                        <br> التوقيع /
                                        <br> المدير المفوض لشركة بوابة العلم
                                        <br> للمقاولات العامة المحدودة/ اضافة
                                        <br> لوظيفته
                                    </p>
                                </div>
                            </div>
                            @if ($contract_installments->count() == 12)
                                <br>
                                <br>
                                <br>
                                <br>
                                <br>
                                <br>
                                <br>
                                <br>
                                <div style="display: flex; justify-content: center;">
                                    <p style="font-size: 14px; font-weight: bold;">صفحة ( 7 - 7)</p>
                                </div>
                            @endif
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</x-app-layout>
